In [2]:
pwd

'C:\\Users\\USER\\Desktop\\Python_Basic'

In [3]:
import pandas as pd
import numpy as np

In [4]:
#데이터 구조
#1차원: 시리즈    
#2차원: 데이터프레임

In [5]:
s = pd.Series([3,-5,7,4], index=['a','b','c','d'])
s

a    3
b   -5
c    7
d    4
dtype: int64

## 데이터프레임 : 2차원 구조(행,열) - 엑셀

In [46]:
data = {'Country':['Belgium','Indea','Brazil'],'Capital':['Brussels','New delhi','Brazilia'],'Population':[11190846,1303171035,207847528]}
data

{'Country': ['Belgium', 'Indea', 'Brazil'],
 'Capital': ['Brussels', 'New delhi', 'Brazilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [7]:
#data 딕셔녀리를 판다스로 만들기

In [14]:
df = pd.DataFrame(data)
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    Indea  New delhi  1303171035
2   Brazil   Brazilia   207847528

df = pd.DataFrame(data, columns=['Country', 'Capital''Population'])
df

In [8]:
df = pd.DataFrame(data, columns=['Country','Capital','Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    Indea  New delhi  1303171035
2   Brazil   Brazilia   207847528

In [9]:
# shift + tap을 이용해 함수의 필요를 알수있다.

In [11]:
df[1:] #데이터를 자를때 사용

  Country    Capital  Population
1   Indea  New delhi  1303171035
2  Brazil   Brazilia   207847528

## loc, iloc : 원하는 데이터 찾기

In [12]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    Indea  New delhi  1303171035
2   Brazil   Brazilia   207847528

In [15]:
df.iloc[0,0] #행 = 0 ,열 = 0

'Belgium'

In [18]:
df.iloc[1,1:3]

Capital        New delhi
Population    1303171035
Name: 1, dtype: object

In [17]:
#iloc = 순서로 원하는 데이터 찾기

In [19]:
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    Indea  New delhi  1303171035
2   Brazil   Brazilia   207847528

In [20]:
df.loc[0,'Country']

'Belgium'

In [22]:
#loc = 행순서 + 목록으로 찾기

In [23]:
df.drop('Country',axis=1)

     Capital  Population
0   Brussels    11190846
1  New delhi  1303171035
2   Brazilia   207847528

In [37]:
df = pd.DataFrame(data, columns=['Country','Capital','Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    Indea  New delhi  1303171035
2   Brazil   Brazilia   207847528

In [38]:
del df['Country']
df

     Capital  Population
0   Brussels    11190846
1  New delhi  1303171035
2   Brazilia   207847528

In [45]:
# del과 drop은 key. value 제거

In [44]:
df.sort_values(by='Population', ascending = False)

     Capital  Population
1  New delhi  1303171035
2   Brazilia   207847528
0   Brussels    11190846

## 판다스 구조 확인

In [49]:
data = {'Country':['Belgium','Indea','Brazil'],'Capital':['Brussels','New delhi','Brazilia'],'Population':[11190846,1303171035,207847528]}
data

{'Country': ['Belgium', 'Indea', 'Brazil'],
 'Capital': ['Brussels', 'New delhi', 'Brazilia'],
 'Population': [11190846, 1303171035, 207847528]}

In [52]:
df = pd.DataFrame(data, columns=['Country','Capital','Population'])
df

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    Indea  New delhi  1303171035
2   Brazil   Brazilia   207847528

In [65]:
print(df.shape)#행렬구조
df.head()#상위 5개

(3, 3)

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    Indea  New delhi  1303171035
2   Brazil   Brazilia   207847528

In [66]:
df.index

RangeIndex(start=0, stop=3, step=1)

In [58]:
df.columns[0]

'Country'

In [60]:
df.columns

Index(['Country', 'Capital', 'Population'], dtype='object')

In [62]:
df.info() #자료형 확인(문지,숫지)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 112.0+ bytes

In [63]:
df.count()

Country       3
Capital       3
Population    3
dtype: int64

In [67]:
df.sum()

Country              BelgiumIndeaBrazil
Capital       BrusselsNew delhiBrazilia
Population                   1522209409
dtype: object

In [69]:
df.cumsum()

              Country                    Capital  Population
0             Belgium                   Brussels    11190846
1        BelgiumIndea          BrusselsNew delhi  1314361881
2  BelgiumIndeaBrazil  BrusselsNew delhiBrazilia  1522209409

In [70]:
df.max()

Country            Indea
Capital        New delhi
Population    1303171035
dtype: object

In [72]:
df.describe() #통계요약

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [73]:
df.mean()

Population    5.074031e+08
dtype: float64

In [74]:
df.apply(lambda x: x*2) #apply = 함수적용 lambda = 함수지정

          Country             Capital  Population
0  BelgiumBelgium    BrusselsBrussels    22381692
1      IndeaIndea  New delhiNew delhi  2606342070
2    BrazilBrazil    BraziliaBrazilia   415695056